<template>
  <div class="about">
    <h1>Таблица со справочником мед оборудования</h1>
    <b-table striped hover :items="oborud" :fields="fields"></b-table>
  </div>
</template>

<script>
export default {
  data() {
    return {
      fields: [
        {
          key: "id",
          label: "Код",
        },
        {
          key: "model",
          label: "Модель",
        },
        {
          key: "name",
          label: "Наименование модели",
        },
        {
          key: "type",
          label: "Тип аппарата",
        },
      ],
      oborud: [
        {
          id: "GP0004272", // заводской номер?
          model: "ОКО",
          name: `1. Аппарат рентгеновский цифровой для исследования грудной клетки ФЦ - "ОКО" по ТУ 9442-023-11150760-2007, заводской №GP 0004272, выпуск 2020 года (кабинет №123),
2. Маммограф рентгеновский МР-"Диамант" по ТУ 9442-004-86112671-2011, заводской №123, выпуск 2019 года (кабинет №127).`,
          // наименования стоят в хаотичном порядке
          type: "Ф",
        },
      ],
    };
  },
  components: {},
};
</script>
